luciengaitskell/quiesink/fw/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ARDUINO_VARIANT="esp32s3"
# CONFIG_AUTOSTART_ARDUINO is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_TFT_HSPI_PORT=y
# Seeed_GFX legacy ESP-IDF Kconfig (must match the relevant QUIESINK_PIN_D*).
CONFIG_TFT_MOSI=9
CONFIG_QUIESINK_PIN_D10=9
CONFIG_TFT_SCLK=7
CONFIG_QUIESINK_PIN_D8=7
CONFIG_TFT_SPI_FREQUENCY=10000000
CONFIG_TFT_SPI_READ_FREQ=4000000
